app/channels/application_cable/connection.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_verified_user

      @current_user = User.find_by(:id => cookies[:user_info])