app/services/matchmaking_queue_service.rb

  def add_to_queue(language)
    return if
      MatchmakingQueue.exists?(user: @user, language: language, status: 'waiting') ||
      MatchmakingQueue.exists?(user: @user, status: 'playing')
    @language = language
    user = MatchmakingQueue.exists?(user: @user)
    if user && user.language != language
      user.language = language
    else
      MatchmakingQueue.create!(user: @user, status: 'waiting', language: language)
---
INSERT INTO "matches" ("language", "status", "player_1_id", "player_2_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["language", "python3"], ["status", nil], ["player_1_id", 1], ["player_2_id", 7], ["created_at", "2024-08-26 15:01:02.288040"], ["updated_at", "2024-08-26 15:01:02.288040"]]