app/views/profiles/admin_profile.html.erb

SELECT "test_cases".* FROM "test_cases" WHERE "test_cases"."challenge_id" = ?  [["challenge_id", 1]]
---
              <ul>
                <% challenge.test_cases.each do |test_case| %>