app/views/profiles/user_profile.html.erb

                  <ul class="list-disc list-inside space-y-2">
                    <% challenge.test_cases.each do |test_case| %>
---
SELECT "test_cases".* FROM "test_cases" WHERE "test_cases"."challenge_id" = ?  [["challenge_id", 12]]

                  <ul class="list-disc list-inside space-y-2">
                    <% challenge.test_cases.each do |test_case| %>
---
SELECT "test_cases".* FROM "test_cases" WHERE "test_cases"."challenge_id" = ?  [["challenge_id", 10]]