app/controllers/application_controller.rb

INSERT INTO "players" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Player_fa65a7c3"], ["created_at", "2024-08-26 14:53:07.404713"], ["updated_at", "2024-08-26 14:53:07.404713"]]
SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Player_fa65a7c3"], ["LIMIT", 1]]
---
  def set_player_name
    @player_name = "Player_#{SecureRandom.hex(4)}"
    @player = Player.find_or_create_by(name: @player_name)