app/controllers/auth0_controller.rb

INSERT INTO "users" ("name", "email", "auth0_id", "created_at", "updated_at", "is_admin") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."auth0_id" = ? LIMIT ?  [["auth0_id", "auth0|66c21738664fea6c618d1144"], ["LIMIT", 1]]
---
  def callback
    # OmniAuth stores the information returned from Auth0 and the IdP in request.env['omniauth.auth'].
    # In this code, you will pull the raw_info supplied from the id_token and assign it to the sessions.
    auth_info = request.env['omniauth.auth']
    # Estrai le informazioni dell'utente
    auth0_id = auth_info['uid']
    email = auth_info['info']['email']
    name = auth_info['info']['name']
    response = Auth0Service.get_user_info(auth0_id)
    username = response["username"] || name

    provider = (auth0_id.split('|').first).split("-").first

    #Find or create a user based on the Auth0 UID
    user = User.find_or_create_by!(email: email) do |user|

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def logout
    if current_user.guest?
      User.find(current_user.id).destroy