app/controllers/challenges_controller.rb

INSERT INTO "challenges" ("description", "created_at", "updated_at", "status", "rejection_reason", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["description", "ti prego "], ["created_at", "2024-08-21 14:24:12.753615"], ["updated_at", "2024-08-21 14:24:12.753615"], ["status", -1], ["rejection_reason", nil], ["user_id", 4]]
---
  def create
    @challenge = current_user.challenges.build(challenge_params)
    if @challenge.save

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "challenges" SET "updated_at" = ?, "status" = ?, "rejection_reason" = ? WHERE "challenges"."id" = ?  [["updated_at", "2024-08-21 14:24:34.298398"], ["status", 0], ["rejection_reason", "cazzo se non funzioni cancello tutto"], ["id", 6]]
---
  def update_status
    @challenge = Challenge.find(params[:id])
    puts "Trovato challenge: #{@challenge.inspect}"

    @challenge.status = params[:status]
    puts "Nuovo stato: #{@challenge.status}"

    if @challenge.status.to_i == 0
      @challenge.rejection_reason = params[:rejection_reason]
      puts "Motivo del rifiuto: #{@challenge.rejection_reason}"
    else
      @challenge.rejection_reason = nil
    end

    if @challenge.save