app/controllers/matchmaking_controller.rb

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "players" ("id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["id", 7], ["name", nil], ["created_at", "2024-08-26 15:12:26.368903"], ["updated_at", "2024-08-26 15:12:26.368903"]]
---
  def challenge_friend
    player = Player.find_or_create_by(name: session[:player_name])
    friend = Player.find(params[:friend_id])
    challenge = Challenge.create(player_1: player, player_2: friend, status: 'pending')

INSERT INTO "players" ("id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["id", 7], ["name", nil], ["created_at", "2024-08-26 15:12:26.368903"], ["updated_at", "2024-08-26 15:12:26.368903"]]
SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Player_ef536ca4"], ["LIMIT", 1]]
INSERT INTO "rooms" ("match_id", "uuid", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["match_id", 1], ["uuid", "8f7ac5eb-67d5-4a87-9994-eb809d0e78de"], ["created_at", "2024-08-26 15:12:26.389089"], ["updated_at", "2024-08-26 15:12:26.389089"]]
---
  def find_opponent
    player = Player.find_or_create_by(name: session[:player_name])
    opponent = Player.where.not(id: player.id).sample
    challenge = Challenge.create(player_1: player, player_2: opponent, status: 'pending')
    room = Room.create(challenge: challenge, uuid: SecureRandom.uuid)