app/controllers/matches_controller.rb

INSERT INTO "players" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Player_e4683794"], ["created_at", "2024-08-26 15:14:13.851513"], ["updated_at", "2024-08-26 15:14:13.851513"]]
SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Player_e4683794"], ["LIMIT", 1]]
---
  def set_player
    @player = Player.find_or_create_by(name: session[:player_name])

SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_challenge
    @challenge = Match.find_by(id: params[:id])