app/controllers/matchmaking_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def cancel
    player = User.find_by(id: session[:user_id])