app/controllers/profiles_controller.rb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."status" = ?  [["status", -1]]
SELECT "users".* FROM "users" WHERE "users"."is_admin" = ? ORDER BY "users"."name" ASC  [["is_admin", 0]]
---
  def admin_profile
    @challenges = Challenge.where(status: -1)
    @non_admin_users = User.where(is_admin: false).order('users.username')

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "is_admin" = ? WHERE "users"."id" = ?  [["updated_at", "2024-08-24 16:30:01.231137"], ["is_admin", 1], ["id", 10]]
---
  def promote_to_admin
    user = User.find(params[:id])
    if user.update(is_admin: true)

SELECT "challenges".* FROM "challenges" WHERE "challenges"."status" = ? AND "challenges"."user_id" = ?  [["status", 1], ["user_id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def user_profile
    @accepted_challenges = Challenge.where(status: 1, user_id: session[:user_id])
    @rejected_challenges = Challenge.where(status: 0, user_id: session[:user_id])

    @user = User.find(session[:user_id])