app/controllers/settings_controller.rb

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "lenny21@gmail.com"], ["updated_at", "2024-08-25 14:09:11.841388"], ["id", 12]]
---
  def update
    if current_user.guest?
      flash[:alert] = "You must be logged in to edit your profile."
      redirect_to root_path
    else
      @user = current_user
      if @user.update(user_params)